package com.jstarcraft.crawler.trade.security;

/**
 * 东方财富字段
 * 
 * http://quote.eastmoney.com/center/js/gridlist.js
 * http://quote.eastmoney.com/center/js/gridlist3.js
 * http://quote.eastmoney.com/newstatic/build/bond.js
 * 
 * https://github.com/xxuzhengg/eastmoney
 * https://unclevicky.github.io/rabbitBear/2021/02/01/%E9%87%8F%E5%8C%96%E6%8A%95%E8%B5%844/
 * 
 * @author Birdy
 *
 */
public enum EastmoneyField {

    f2("最新价格"),

    f3("涨跌幅"),

    f4("涨跌额"),

    f5("成交量"),

    f6("成交额"),

    f7("振幅"),

    f8("换手率"),

    f9("市盈率/交易时间"),

    f10("量比"),

    f11("涨跌幅_5分"),

    f12("代码"),

    f13("交易所"),

    f14("名称"),

    f15("最高价格"),

    f16("最低价格"),

    f17("开盘价格"),

    f18("收盘价格"),

    f20("总市值"),

    f21("流通市值"),

    f22("涨跌速"),

    f23("市净率"),

    f24("涨跌幅_60日"),

    f25("涨跌幅_年至今"),

    f26("发行日期"),

    f28("昨结"),

    f30("现量"),

    f31("现汇买入价格/买入价或买一价"),

    f32("现汇卖出价格/卖出价或卖一价"),

    f33("委比"),

    f34("买盘(外盘)"),

    f35("卖盘(内盘)"),

    f45("净利润"),

    f49("毛利率"),

    f58("股东权益"),

    f62("主力净流入"),

    f66("超大单净流入"),

    f69("超大单净占比"),

    f72("大单净流入"),

    f75("大单净占比"),

    f78("中单净流入"),

    f81("中单净占比"),

    f84("小单净流入"),

    f87("小单净占比"),

    f104("上涨家数"),

    f105("下跌家数"),

    f106("平盘家数"),

    f108("持仓量"),

    f109("涨跌幅_5日"),

    f113("每股净资产"),

    f115("市盈率"),

    f124("更新时间"),

    f127("涨跌幅_3日"),

    f128("领涨股"),

    f130("市销率TTM"),

    f131("市现率TTM"),

    f132("总营业收入TTM"),

    f133("股息率"),

    f134("行业板块的成分股数"),

    f136("涨跌幅_领涨股"),

    f137("净资产收益率TTM"),

    f138("净利润TTM"),

    f142("现钞买入价格"),

    f143("现钞卖出价格"),

    f149("涨跌幅_6日"),

    f160("涨跌幅_10日"),

    f161("期权行权价格"),

    f162("剩余日"),

    f163("日增"),

    f184("主力净占比"),

    f186("最新价格"),

    f187("涨跌幅"),

    f188("溢价(A/H)%"),

    f189("比价(A/H)"),

    f191("代码"),

    f193("名称"),

    f196("最新价格"),

    f197("涨跌幅"),

    f199("比价(A/B)"),

    f201("AB股对应的代码"),

    f202("AB股对应的市场"),

    f203("AB股对应的名称"),

    f204("主力最大股"),

    f207("领跌股"),

    f211("买量"),

    f212("卖量"),

    f213("N股代码"),

    f217("涨跌额"),

    f218("涨跌幅"),

    f219("折合美元"),

    f220("折合港元"),

    f222("涨跌幅"),

    f223("排名"),

    f225("排名"),

    f226("排行变化"),

    f227("纯债价值"),

    f229("最新价格"),

    f230("涨跌幅"),

    f232("正股代码"),

    f234("正股名称"),

    f235("转股价格"),

    f236("转股价值"),

    f237("转股溢价率"),

    f238("纯债溢价率"),

    f239("回售价格"),

    f240("强赎价格"),

    f241("到期价格"),

    f242("转股日期"),

    f243("申购日期"),

    f249("期权波动率"),

    f250("期权折溢价率"),

    f339("最新"),

    f340("名称"),

    f341("涨跌幅"),

    f342("涨跌额"),

    f344("成交量"),

    f345("持仓量"),

    f346("波动率"),

    f347("折溢价率"),

    f348("可转债申购代码"),

    f1020("总市值行业排名"),

    f1023("市净率行业排名"),

    f1037("ROE行业排名"),

    f1045("净利润行业排名"),

    f1049("毛利率行业排名"),

    f1058("股东权益行业排名"),

    f1115("市盈率TTM行业排名"),

    f1129("净利率行业排名"),

    f1130("市销率TTM行业排名"),

    f1131("市现率TTM行业排名"),

    f1132("总营业收入TTM行业排名"),

    f1133("股息率行业排名"),

    f1135("净资产行业排名"),

    f1137("市盈率动态行业排名"),

    f1138("净利润TTM行业排名"),

    f3020("总市值行业排名四分位"),

    f3023("市净率行业排名四分位"),

    f3037("ROE行业排名四分位"),

    f3045("净利润行业排名四分位"),

    f3049("毛利率行业排名四分位"),

    f3058("股东权益行业排名四分位"),

    f3115("市盈率TTM行业排名四分位"),

    f3129("净利率行业排名四分位"),

    f3130("市销率TTM行业排名四分位"),

    f3131("市现率TTM行业排名四分位"),

    f3132("总营业收入TTM行业排名四分位"),

    f3133("股息率行业排名四分位"),

    f3135("净资产行业排名四分位"),

    f3137("市盈率动态行业排名四分位"),

    f3138("净利润TTM行业排名四分位");

    private final String name;

    private EastmoneyField(String name) {
        this.name = name;
    }

    public String getName() {
        return name;
    }

}
