package com.jstarcraft.crawler.trade.security;

/**
 * 东方财富字段
 * 
 * http://quote.eastmoney.com/center/js/gridlist.js
 * http://quote.eastmoney.com/center/js/gridlist3.js
 * 
 * @author Birdy
 *
 */
public enum EastmoneyField {

    f2("最新价"),

    f3("涨跌幅"),

    f4("涨跌额"),

    f5("成交量(手)"),

    f6("成交额"),

    f7("振幅"),

    f8("换手率"),

    f9("市盈率(动态)"),

    f10("量比"),

    f11("5分钟涨跌"),

    f12("代码"),

    f13("所属交易所"),

    f14("名称"),

    f15("最高"),

    f16("最低"),

    f17("今开"),

    f18("昨收"),

    f20("总市值"),

    f21("流通市值"),

    f22("涨速"),

    f23("市净率"),

    f24("60日涨跌幅"),

    f25("年初至今涨跌幅"),

    f26("上市时间"),

    f28("昨结"),

    f30("现量"),

    f31("现汇买入价"),

    f32("现汇卖出价"),

    f33("委比"),

    f34("买盘(外盘)"),

    f35("卖盘(内盘)"),

    f45("净利润"),

    f62("主力净流入"),

    f104("上涨家数"),

    f105("下跌家数"),

    f108("持仓量"),

    f115("市盈率"),

    f124("最新行情时间"),

    f128("领涨股"),

    f136("涨跌幅"),

    f142("现钞买入价"),

    f143("现钞卖出价"),

    f161("行权价"),

    f162("剩余日"),

    f163("日增"),

    f184("主力净占比"),

    f186("最新价(RMB)"),

    f187("涨跌幅"),

    f188("溢价（A/H）%"),

    f189("比价（A/H）"),

    f191("A股代码"),

    f193("名称"),

    f196("最新价"),

    f197("涨跌幅"),

    f199("比价（A/B）"),

    f201("B股代码"),

    f203("名称"),

    f204("主力流入最大股"),

    f207("领跌股票"),

    f211("买量"),

    f212("卖量"),

    f213("ADR代码"),

    f217("涨跌额"),

    f218("涨跌幅"),

    f219("ADR收市价(USD)"),

    f220("折合每股港元"),

    f222("涨跌幅"),

    f223("排名"),

    f225("排名"),

    f226("排行变化"),

    f227("纯债价值"),

    f229("最新价"),

    f230("涨跌幅"),

    f232("正股代码"),

    f234("正股名称"),

    f235("转股价"),

    f236("转股价值"),

    f237("转股溢价率"),

    f238("纯债溢价率"),

    f239("回售触发价"),

    f240("强赎触发价"),

    f241("到期赎回价"),

    f242("开始转股日"),

    f243("申购日期"),

    f249("隐含波动率"),

    f250("折溢价率"),

    f339("最新"),

    f340("名称"),

    f341("涨跌幅"),

    f342("涨跌额"),

    f344("成交量"),

    f345("持仓量"),

    f346("隐含波动率"),

    f347("折溢价率");

    private final String name;

    private EastmoneyField(String name) {
        this.name = name;
    }

    public String getName() {
        return name;
    }

}
